app/Http/Controllers/ArticleController.php

select * from "articles"
select "tags".*, "article_tag"."article_id" as "pivot_article_id", "article_tag"."tag_id" as "pivot_tag_id", "article_tag"."created_at" as "pivot_created_at", "article_tag"."updated_at" as "pivot_updated_at" from "tags" inner join "article_tag" on "tags"."id" = "article_tag"."tag_id" where "article_tag"."article_id" in (2, 4, 5, 6)
select "users".*, "likes"."article_id" as "pivot_article_id", "likes"."user_id" as "pivot_user_id", "likes"."created_at" as "pivot_created_at", "likes"."updated_at" as "pivot_updated_at" from "users" inner join "likes" on "users"."id" = "likes"."user_id" where "likes"."article_id" in (2, 4, 5, 6)
---
    public function index()
    {
        $articles = Article::all()->sortByDesc('created_at')
            // ->load('user');
            ->load(['user', 'likes', 'tags']);

select * from "tags"
---
    public function create()
    {
        $allTagNames = Tag::all()->map(function ($tag) {
            return ['text' => $tag->name];
        });

insert into "articles" ("title", "body", "user_id", "updated_at", "created_at") values ('foo2', 'foo2', 3, '2022-07-10 11:45:02', '2022-07-10 11:45:02') returning "id"
insert into "tags" ("name", "updated_at", "created_at") values ('foo2', '2022-07-10 11:45:02', '2022-07-10 11:45:02') returning "id"
select * from "tags" where ("name" = 'foo2') limit 1
---
    public function store(ArticleRequest $request, Article $article)
    {
        $article->fill($request->all());
        $article->user_id = $request->user()->id;
        $article->save();

        $request->tags->each(function ($tagName) use ($article) {
            $tag = Tag::firstOrCreate(['name' => $tagName]);

delete from "articles" where "id" = 3
---
    public function destroy(Article $article)
    {
        $article->delete();

delete from "likes" where "likes"."article_id" = 5 and "likes"."user_id" in (2)
insert into "likes" ("article_id", "created_at", "updated_at", "user_id") values (5, '2022-07-10 11:41:48', '2022-07-10 11:41:48', 2)
---
    public function like(Request $request, Article $article)
    {
        $article->likes()->detach($request->user()->id);
        $article->likes()->attach($request->user()->id);