app/Http/Controllers/UserController.php

select "tags".*, "article_tag"."article_id" as "pivot_article_id", "article_tag"."tag_id" as "pivot_tag_id", "article_tag"."created_at" as "pivot_created_at", "article_tag"."updated_at" as "pivot_updated_at" from "tags" inner join "article_tag" on "tags"."id" = "article_tag"."tag_id" where "article_tag"."article_id" in (6)
select "users".*, "likes"."article_id" as "pivot_article_id", "likes"."user_id" as "pivot_user_id", "likes"."created_at" as "pivot_created_at", "likes"."updated_at" as "pivot_updated_at" from "users" inner join "likes" on "users"."id" = "likes"."user_id" where "likes"."article_id" in (6)
select * from "articles" where "articles"."user_id" in (3)
---
    public function show(string $name)
    {
        $user = User::where('name', $name)->first()
            ->load(['articles.user', 'articles.likes', 'articles.tags']);

select * from "users" where "users"."id" in (2)
---
    public function likes(string $name)
    {
        $user = User::where('name', $name)->first()
            ->load(['likes.user', 'likes.likes', 'likes.tags']);

select * from "users" where "name" = 'foo' limit 1
---
    public function followings(string $name)
    {
        $user = User::where('name', $name)->first();